In [1]:
import pandas as pd

In [2]:
wiki_data = pd.read_csv('Data/wiki_total_1208.csv')
news_data = pd.read_csv('Data/node_news_1208.csv')

In [3]:
wiki_data.head()

,:START_ID,:END_ID,:TYPE,subject_entity,object_entity,source_type
0,chips,resin,use,ORG,ORG,Wiki
1,avago technologies,infineon technologies,acquire,ORG,ORG,Wiki
2,avago technologies,broadcom corporation,buy,ORG,ORG,Wiki
3,qualcomm,broadcom,purchase,PERSON,ORG,Wiki
4,the european union,broadcom,stop,ORG,ORG,Wiki

In [4]:
news_data.head()

,:START_ID,:END_ID,:TYPE,subject_entity,object_entity,source_type
0,goldman sachs gs.n,marvell,upgrade,ORG,ORG,News
1,apple,vendors,instruct,ORG,PRODUCT,News
2,abada,bitfly,recommend,PERSON,PERSON,News
3,south africa,sales,run,GPE,PRODUCT,News
4,apple,iphone,slash,ORG,ORG,News

In [5]:
df_tkn1 = news_data[[':START_ID','subject_entity']]
df_tkn1.columns = ['name',':LABEL']
df_tkn2 = news_data[[':END_ID','object_entity']]
df_tkn2.columns = ['name',':LABEL']
df_tkn3 = wiki_data[[':START_ID','subject_entity']]
df_tkn3.columns = ['name',':LABEL']
df_tkn4 = wiki_data[[':END_ID','object_entity']]
df_tkn4.columns = ['name',':LABEL']
df_tkn_merged = pd.concat([df_tkn1,df_tkn2,df_tkn3,df_tkn4], ignore_index=True)
df_tkn_merged = df_tkn_merged.drop_duplicates(subset=['name'])
df_tkn_merged.reset_index(inplace = True)
df_tkn_merged.reset_index(inplace = True)
df_tkn_merged = df_tkn_merged.rename(columns={'level_0':'Id:ID'})
df_tkn_merged['Id:ID'] = df_tkn_merged['name'].apply(lambda x : x.upper())
df_tkn_merged = df_tkn_merged.drop('index',axis=1)
df_tkn_merged.head()

                Id:ID                name  :LABEL
0  GOLDMAN SACHS GS.N  goldman sachs gs.n     ORG
1               APPLE               apple     ORG
2               ABADA               abada  PERSON
3        SOUTH AFRICA        south africa     GPE
4    WILLIAM HUFFHINE    william huffhine  PERSON

In [6]:
df_tkn_merged.tail()

                   Id:ID                name  :LABEL
2029      HABIBA SULTANA      habiba sultana  PERSON
2030     NEW SOUTH WALES     new south wales     GPE
2031           BELIZEANS           belizeans    NORP
2032  SAINT NICHOLAS DAY  saint nicholas day  PERSON
2033           BHUTANESE           bhutanese    NORP

In [7]:
def create_id(x):
    text = x.split()
    text = '_'.join(text)
    return text

In [8]:
df_tkn_merged['Id:ID'] = df_tkn_merged['Id:ID'].apply(lambda x : create_id(x))

In [9]:
df_tkn_merged.head()

                Id:ID                name  :LABEL
0  GOLDMAN_SACHS_GS.N  goldman sachs gs.n     ORG
1               APPLE               apple     ORG
2               ABADA               abada  PERSON
3        SOUTH_AFRICA        south africa     GPE
4    WILLIAM_HUFFHINE    william huffhine  PERSON

In [10]:
df_tkn_merged = df_tkn_merged.drop_duplicates(subset=['Id:ID'])
df_tkn_merged = df_tkn_merged[(df_tkn_merged['Id:ID'].str.len()>2)]

In [11]:
df_tkn_merged.to_csv('Data/node_all_1208.csv',index = False)

In [12]:
len(df_tkn_merged)

2034

In [13]:
def clean_rel(x):
    text = x.replace('!','')
    return text

In [14]:
df_merged = pd.concat([news_data,wiki_data])
df_merged = df_merged.drop_duplicates()
# df_merged = df_merged.drop(['created_at','verb_source_name'],axis=1)
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2812 entries, 0 to 1425
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   :START_ID       2812 non-null   object
 1   :END_ID         2812 non-null   object
 2   :TYPE           2812 non-null   object
 3   subject_entity  2812 non-null   object
 4   object_entity   2812 non-null   object
 5   source_type     2812 non-null   object
dtypes: object(6)
memory usage: 153.8+ KB

In [15]:
df_merged.head()

,:START_ID,:END_ID,:TYPE,subject_entity,object_entity,source_type
0,goldman sachs gs.n,marvell,upgrade,ORG,ORG,News
1,apple,vendors,instruct,ORG,PRODUCT,News
2,abada,bitfly,recommend,PERSON,PERSON,News
3,south africa,sales,run,GPE,PRODUCT,News
4,apple,iphone,slash,ORG,ORG,News

In [16]:
df_merged[':TYPE'] = df_merged[':TYPE'].apply(lambda x : clean_rel(x))
df_merged[':TYPE'] = df_merged[':TYPE'].apply(lambda x : create_id(x.upper()))
df_merged[':START_ID'] = df_merged[':START_ID'].apply(lambda x : create_id(x.upper()))
df_merged[':END_ID'] = df_merged[':END_ID'].apply(lambda x : create_id(x.upper()))

In [17]:
print(len(df_merged))

2812

In [18]:
df_merged.reset_index(drop=True, inplace=True)
df_merged.to_csv('Data/rel_all_1208.csv',index = False)

In [40]:
# test_df = pd.read_csv('sub_vb_ob_lib2_news_10k.csv')

In [19]:
# len(test_df)

In [20]:
# test_df.head()